{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "transformer_encoder_block", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "Transformer_Block_Input"}, "name": "Transformer_Block_Input", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "Layer_Norm_1_0", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_Norm_1_0", "inbound_nodes": [[["Transformer_Block_Input", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "MSA_Block_0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "MSA_Main_Input"}, "name": "MSA_Main_Input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "Query_Dense_0_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_0_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_0_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_0_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_1_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_1_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_1_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_1_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_2_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_2_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_2_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_2_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_3_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_3_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_3_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_3_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_4_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_4_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_4_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_4_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_5_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_5_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_5_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_5_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_6_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_6_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_6_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_6_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_7_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_7_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_7_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_7_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_0_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_0_0", "inbound_nodes": [[["Query_Dense_0_0", 0, 0, {}], ["Key_Dense_0_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_1_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_1_0", "inbound_nodes": [[["Query_Dense_1_0", 0, 0, {}], ["Key_Dense_1_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_2_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_2_0", "inbound_nodes": [[["Query_Dense_2_0", 0, 0, {}], ["Key_Dense_2_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_3_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_3_0", "inbound_nodes": [[["Query_Dense_3_0", 0, 0, {}], ["Key_Dense_3_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_4_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_4_0", "inbound_nodes": [[["Query_Dense_4_0", 0, 0, {}], ["Key_Dense_4_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_5_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_5_0", "inbound_nodes": [[["Query_Dense_5_0", 0, 0, {}], ["Key_Dense_5_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_6_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_6_0", "inbound_nodes": [[["Query_Dense_6_0", 0, 0, {}], ["Key_Dense_6_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_7_0", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_7_0", "inbound_nodes": [[["Query_Dense_7_0", 0, 0, {}], ["Key_Dense_7_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_0_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_0_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_0_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_0_0", "inbound_nodes": [[["Dot_Layer_1_0_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_1_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_1_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_1_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_1_0", "inbound_nodes": [[["Dot_Layer_1_1_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_2_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_2_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_2_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_2_0", "inbound_nodes": [[["Dot_Layer_1_2_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_3_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_3_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_3_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_3_0", "inbound_nodes": [[["Dot_Layer_1_3_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_4_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_4_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_4_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_4_0", "inbound_nodes": [[["Dot_Layer_1_4_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_5_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_5_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_5_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_5_0", "inbound_nodes": [[["Dot_Layer_1_5_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_6_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_6_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_6_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_6_0", "inbound_nodes": [[["Dot_Layer_1_6_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_7_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_7_0", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_7_0", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_7_0", "inbound_nodes": [[["Dot_Layer_1_7_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_0_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_0_0", "inbound_nodes": [[["Value_Dense_0_0", 0, 0, {}], ["Softmax_0_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_1_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_1_0", "inbound_nodes": [[["Value_Dense_1_0", 0, 0, {}], ["Softmax_1_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_2_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_2_0", "inbound_nodes": [[["Value_Dense_2_0", 0, 0, {}], ["Softmax_2_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_3_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_3_0", "inbound_nodes": [[["Value_Dense_3_0", 0, 0, {}], ["Softmax_3_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_4_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_4_0", "inbound_nodes": [[["Value_Dense_4_0", 0, 0, {}], ["Softmax_4_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_5_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_5_0", "inbound_nodes": [[["Value_Dense_5_0", 0, 0, {}], ["Softmax_5_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_6_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_6_0", "inbound_nodes": [[["Value_Dense_6_0", 0, 0, {}], ["Softmax_6_0", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_7_0", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_7_0", "inbound_nodes": [[["Value_Dense_7_0", 0, 0, {}], ["Softmax_7_0", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concatenate_0", "trainable": true, "dtype": "float32", "axis": 2}, "name": "Concatenate_0", "inbound_nodes": [[["Dot_Layer_2_0_0", 0, 0, {}], ["Dot_Layer_2_1_0", 0, 0, {}], ["Dot_Layer_2_2_0", 0, 0, {}], ["Dot_Layer_2_3_0", 0, 0, {}], ["Dot_Layer_2_4_0", 0, 0, {}], ["Dot_Layer_2_5_0", 0, 0, {}], ["Dot_Layer_2_6_0", 0, 0, {}], ["Dot_Layer_2_7_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Final_MSA_Linear_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Final_MSA_Linear_0", "inbound_nodes": [[["Concatenate_0", 0, 0, {}]]]}], "input_layers": [["MSA_Main_Input", 0, 0]], "output_layers": [["Final_MSA_Linear_0", 0, 0]]}, "name": "MSA_Block_0", "inbound_nodes": [[["Layer_Norm_1_0", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Residual_Connection_0", "trainable": true, "dtype": "float32"}, "name": "Residual_Connection_0", "inbound_nodes": [[["Transformer_Block_Input", 0, 0, {}], ["MSA_Block_0", 1, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Layer_Norm_2_0", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_Norm_2_0", "inbound_nodes": [[["Residual_Connection_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense_1_0", "trainable": true, "dtype": "float32", "units": 8, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense_1_0", "inbound_nodes": [[["Layer_Norm_2_0", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout_1_0", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Dropout_1_0", "inbound_nodes": [[["Dense_1_0", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Transformer_Encoder_Output_0", "trainable": true, "dtype": "float32"}, "name": "Transformer_Encoder_Output_0", "inbound_nodes": [[["Residual_Connection_0", 0, 0, {}], ["Dropout_1_0", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Layer_Norm_1_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_Norm_1_1", "inbound_nodes": [[["Transformer_Encoder_Output_0", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "MSA_Block_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 49, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "MSA_Main_Input"}, "name": "MSA_Main_Input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "Query_Dense_0_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_0_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_0_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_0_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_1_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_1_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_1_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_1_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_2_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_2_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_2_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_2_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_3_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_3_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_3_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_3_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_4_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_4_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_4_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_4_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_5_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_5_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_5_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_5_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_6_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_6_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_6_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_6_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Query_Dense_7_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Query_Dense_7_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Key_Dense_7_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Key_Dense_7_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_0_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_0_1", "inbound_nodes": [[["Query_Dense_0_1", 0, 0, {}], ["Key_Dense_0_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_1_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_1_1", "inbound_nodes": [[["Query_Dense_1_1", 0, 0, {}], ["Key_Dense_1_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_2_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_2_1", "inbound_nodes": [[["Query_Dense_2_1", 0, 0, {}], ["Key_Dense_2_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_3_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_3_1", "inbound_nodes": [[["Query_Dense_3_1", 0, 0, {}], ["Key_Dense_3_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_4_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_4_1", "inbound_nodes": [[["Query_Dense_4_1", 0, 0, {}], ["Key_Dense_4_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_5_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_5_1", "inbound_nodes": [[["Query_Dense_5_1", 0, 0, {}], ["Key_Dense_5_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_6_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_6_1", "inbound_nodes": [[["Query_Dense_6_1", 0, 0, {}], ["Key_Dense_6_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_1_7_1", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Dot_Layer_1_7_1", "inbound_nodes": [[["Query_Dense_7_1", 0, 0, {}], ["Key_Dense_7_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_0_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_0_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_0_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_0_1", "inbound_nodes": [[["Dot_Layer_1_0_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_1_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_1_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_1_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_1_1", "inbound_nodes": [[["Dot_Layer_1_1_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_2_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_2_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_2_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_2_1", "inbound_nodes": [[["Dot_Layer_1_2_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_3_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_3_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_3_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_3_1", "inbound_nodes": [[["Dot_Layer_1_3_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_4_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_4_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_4_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_4_1", "inbound_nodes": [[["Dot_Layer_1_4_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_5_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_5_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_5_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_5_1", "inbound_nodes": [[["Dot_Layer_1_5_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_6_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_6_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_6_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_6_1", "inbound_nodes": [[["Dot_Layer_1_6_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Value_Dense_7_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Value_Dense_7_1", "inbound_nodes": [[["MSA_Main_Input", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "Softmax_7_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Softmax_7_1", "inbound_nodes": [[["Dot_Layer_1_7_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_0_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_0_1", "inbound_nodes": [[["Value_Dense_0_1", 0, 0, {}], ["Softmax_0_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_1_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_1_1", "inbound_nodes": [[["Value_Dense_1_1", 0, 0, {}], ["Softmax_1_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_2_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_2_1", "inbound_nodes": [[["Value_Dense_2_1", 0, 0, {}], ["Softmax_2_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_3_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_3_1", "inbound_nodes": [[["Value_Dense_3_1", 0, 0, {}], ["Softmax_3_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_4_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_4_1", "inbound_nodes": [[["Value_Dense_4_1", 0, 0, {}], ["Softmax_4_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_5_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_5_1", "inbound_nodes": [[["Value_Dense_5_1", 0, 0, {}], ["Softmax_5_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_6_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_6_1", "inbound_nodes": [[["Value_Dense_6_1", 0, 0, {}], ["Softmax_6_1", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Dot_Layer_2_7_1", "trainable": true, "dtype": "float32", "axes": 2, "normalize": false}, "name": "Dot_Layer_2_7_1", "inbound_nodes": [[["Value_Dense_7_1", 0, 0, {}], ["Softmax_7_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concatenate_1", "trainable": true, "dtype": "float32", "axis": 2}, "name": "Concatenate_1", "inbound_nodes": [[["Dot_Layer_2_0_1", 0, 0, {}], ["Dot_Layer_2_1_1", 0, 0, {}], ["Dot_Layer_2_2_1", 0, 0, {}], ["Dot_Layer_2_3_1", 0, 0, {}], ["Dot_Layer_2_4_1", 0, 0, {}], ["Dot_Layer_2_5_1", 0, 0, {}], ["Dot_Layer_2_6_1", 0, 0, {}], ["Dot_Layer_2_7_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Final_MSA_Linear_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Final_MSA_Linear_1", "inbound_nodes": [[["Concatenate_1", 0, 0, {}]]]}], "input_layers": [["MSA_Main_Input", 0, 0]], "output_layers": [["Final_MSA_Linear_1", 0, 0]]}, "name": "MSA_Block_1", "inbound_nodes": [[["Layer_Norm_1_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Residual_Connection_1", "trainable": true, "dtype": "float32"}, "name": "Residual_Connection_1", "inbound_nodes": [[["Transformer_Encoder_Output_0", 0, 0, {}], ["MSA_Block_1", 1, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "Layer_Norm_2_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 1e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Layer_Norm_2_1", "inbound_nodes": [[["Residual_Connection_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense_1_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "gelu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense_1_1", "inbound_nodes": [[["Layer_Norm_2_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout_1_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "Dropout_1_1", "inbound_nodes": [[["Dense_1_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Transformer_Encoder_Output_1", "trainable": true, "dtype": "float32"}, "name": "Transformer_Encoder_Output_1", "inbound_nodes": [[["Residual_Connection_1", 0, 0, {}], ["Dropout_1_1", 0, 0, {}]]]}], "input_layers": [["Transformer_Block_Input", 0, 0]], "output_layers": [["Transformer_Encoder_Output_1", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Dense_1_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Dense_1_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Dense_1_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Dense_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_1_0/gamma", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_1_0/beta", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_1_1/gamma", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_1_1/beta", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_2_0/gamma", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_2_0/beta", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_2_1/gamma", "shape": [8], "dtype": "float32"}, {"name": "Layer_Norm_2_1/beta", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_0_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_0_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_0_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_0_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_1_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_1_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_1_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_1_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_2_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_2_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_2_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_2_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_3_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_3_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_3_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_3_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_4_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_4_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_4_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_4_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_5_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_5_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_5_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_5_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_6_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_6_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_6_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_6_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_7_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_7_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_7_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_7_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_0_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_0_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_1_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_1_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_2_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_2_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_3_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_3_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_4_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_4_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_5_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_5_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_6_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_6_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_7_0/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_7_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Final_MSA_Linear_0/kernel", "shape": [64, 8], "dtype": "float32"}, {"name": "Final_MSA_Linear_0/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_0_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_0_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_0_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_0_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_1_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_1_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_2_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_2_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_2_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_2_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_3_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_3_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_3_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_3_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_4_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_4_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_4_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_4_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_5_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_5_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_5_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_5_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_6_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_6_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_6_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_6_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Query_Dense_7_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Query_Dense_7_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Key_Dense_7_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Key_Dense_7_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_0_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_0_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_1_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_1_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_2_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_2_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_3_1/kernel", "shape": [8, 8], "dtype": "float32"}, {"name": "Value_Dense_3_1/bias", "shape": [8], "dtype": "float32"}, {"name": "Value_Dense_4_1/kernel", "shape": [8, 8], 